Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToReplaceWithLink
Selected elements were copied to new file but Revit was unable to replace them with link to that file.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToPasteToFile
Unable to paste current clipboard contents to file.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToCopyElementsFromFile
Unable to copy elements from file.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoSupported2DElementsToCopyFromView
None of the elements in the view you have selected are supported for the insert 2D operation.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.NoFileSaved
No file has been saved.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.ElementsWithNotCopiedParentsDeleted
Some elements were deleted because elements that they require for references were not copied.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.CannotCopyFromMultipleLinks
Elements cannot be copied from multiple links at the same time.

Autodesk.Revit.DB.BuiltInFailures.CuttingFailures
Failures about Cutting.